**** exempl
	 <s
	 #+BEGIN_SRC 
(setq org-structure-template-alist
      '(("s" "#+BEGIN_SRC ?\n\n#+END_SRC\n")
       ("e" "#+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE\n")
       ("q" "#+BEGIN_QUOTE\n?\n#+END_QUOTE\n")
       ("v" "#+BEGIN_VERSE\n?\n#+END_VERSE\n")
       ("V" "#+BEGIN_VERBATIM\n?\n#+END_VERBATIM\n")))
	 #+END_SRC
in new versin 2.0
(add-to-list 'org-structure-template-alist '("t" . "src translate"))
old
(add-to-list 'org-structure-template-alist '("t" "#+BEGIN_SRC ? translate\n\n#+END_SRC\n"))
<t
	 #+BEGIN_SRC  translate
	Ты работаешь? 
	 #+END_SRC

	 #+RESULTS:
	 : Do you work?

(add-to-list 'org-structure-template-alist '("tr" "#+BEGIN_SRC ? translate :dest ru\n\n#+END_SRC\n"))
	 #+BEGIN_SRC  translate :dest ru
 Do you work?
	 #+END_SRC

	 #+RESULTS:
	 : Вы работаете?
	 
	 
**** Tmp 
 
 |---+---------+---------------+------+---|
 |   | sidfsdf | dfsdf  sfdfsf | sdf  |   |
 |   | sdf     | sdfsdf        | sdf  |   |
 |   |         |               | sdfs |   |
 |---+---------+---------------+------+---|
 |   |         |               |      |   |
 |---+---------+---------------+------+---|
 #+name: FOO
 |---+---+---+---+---+---+---+---+----|
 | 1 | 0 | 1 | 1 | 2 | 3 | 4 | 5 | 15 |
 | 3 | 5 | 3 | 3 | 3 | 4 | 5 | 6 | 16 |
 | 5 | 4 | 5 | 5 | 4 | 5 | 6 | 7 | 17 |
 | 9 | 9 | 7 | 7 |   |   |   |   | 18 |
 |---+---+---+---+---+---+---+---+----|
 | 0 | 0 | 0 |   |   |   |   |   |  1 |
 |---+---+---+---+---+---+---+---+----|
 #+TBLFM: $1=$2 * 10 ::$2=$+3
 #+TBLFM: $2=$+3

 #+CONSTANTS: c=10 pi=3.14 eps=2.4e-6
 | 1 | 2 | 3 | 4 | 5 | 6 | 7 |  8 |        9 |
 |---+---+---+---+---+---+---+----+----------|
 | 1 | 3 | 1 | 1 | 2 | 3 | 4 |  5 | 00:02:00 |
 | 3 | 5 | 3 | 3 | 3 | 4 | 5 |  6 | 00:03:00 |
 | 2 | 9 | 2 | 2 | 4 | 6 | 8 | 10 | 00:04:00 |
 | 7 | 0 | 7 | 7 |   |   |   |    | 00:05:00 |
 |---+---+---+---+---+---+---+----+----------|
 | 0 | 0 | 0 |   |   |   |   |    | 00:06:00 |
 |---+---+---+---+---+---+---+----+----------|
 #+TBLFM: $9=@#
 #+TBLFM: $2=$+3::$9=1
 #+TBLFM: $2=$+3
 #+TBLFM: $2= '(identity remote(FOO, @@#$1))
 #+TBLFM: @4 = 2 * remote(FOO, @1$$#)
 #+TBLFM: $1=$+3
 #+TBLFM: $3=$-2
 #+TBLFM: $9=$c+@# 
 #+TBLFM: @1=$# 
 #+TBLFM: $9=@# *60;T 
 #+TBLFM: $9=@# -1
 #+TBLFM: $1=$# -1

			| Sede          | Max cites |              |
			|---------------+-----------+--------------|
			| Chile         |    257.72 | WWWWWWWWWWWW |
			| Leeds         |    165.77 | WWWWWWWh     |
			| Sao Paolo     |     71.00 | WWW;         |
			| Stockholm     |    134.19 | WWWWWW:      |
			| Morelia       |    257.56 | WWWWWWWWWWWW |
			| Rochefourchat |     10.00 | !            |
			#+TBLFM: $3='(orgtbl-ascii-draw $2 0.0 257.72 12)
 (setq evil-want-C-i-jump nil)

		

 (define-key evil-insert-state-map (kbd "TAB") 'tab-to-tab-stop)
 (define-key evil-insert-state-map (kbd "C-i") 'tab-to-tab-stop)

 |---+--------+--------+-----+----|
 |   | dsf    | sdf    | sdf |    |
 |   | asdf   | 43     |  34 | 23 |
 |   | sdfs	 | sfdsdf |     |    |
 |---+--------+--------+-----+----|

 (define-key evil-motion-state-map (kbd "C-i") 'evil-jump-forward)

			M-: (org-element-parse-buffer) <RET>

 :sdf:

 :sdf1:

 :END:

 :END:



		| freeman | 1 | hucker |
		| max     | 1 | humen  |
		|---------+---+--------|
		|         |   |        |
  
		|---------+---+--------|
		|         |   |        |
***** outer

| ! | Ending           | Weeks | Rent |  Total | |---+------------------+-------+------+--------|
| # | [2016-04-18 Mon] |     4 |  180 | 720.00 |
| # | [2016-05-16 Mon] |     4 |  180 | 720.00 |
| # | [2016-06-20 Mon] |     5 |  180 | 900.00 |
#+TBLFM: $5=$Weeks*$Rent; %.2f
#+TBLFM: $3=($2 - @-1$2)/7::$5=$Weeks*$Rent; %.2f0/0/1
#+TBLFM: $3=if(2 == @#, 4, ($2 - @-1$2)/7)::$5=$Weeks*$Rent; %.2f
***** my
|   |       |                        |                       |       |                                      |
|---+-------+------------------------+-----------------------+-------+--------------------------------------|
|   |  1000 | [2020-06-07 Sun 12:24] | [2020-06-07 Вс 10:00] |   0.1 | проснутся                            |
|   |  1005 | [2020-06-07 Sun 10:19] | [2020-06-07 Вс 10:05] |  0.01 | подключить телефон на зарядку        |
|   |  1000 | [2020-06-07 Sun 10:02] | [2020-06-07 Вс 10:01] | 0.001 | включить комп                        |
|   |  1010 | [2020-06-07 Sun 10:10] | [2020-06-07 Вс 10:10] |       | сообшение белому - проверка телефона |
|   |  1015 | [2020-06-07 Sun 10:15] | [2020-06-07 Вс 10:15] |       | принять душь                         |
|   |  1115 | [2020-06-07 Sun 11:15] | [2020-06-07 Вс 11:15] |       | начать складыватсясложится           |
|   |  1145 | [2020-06-07 Sun 11:45] | [2020-06-07 Вс 11:45] |       | выйти                                |
|   |       | 0                      |                       |       | купить воды лоток\сельпо             |
|   |  1245 | [2020-06-08 Mon 13:00] | [2020-06-08 Пн 13:00] |       | выйти из метро                       |
|   | 13:45 | [2020-06-09 Tue 13:00] | [2020-06-09 Вт 13:00] |       |                                      |
|   | 14:45 | 2                      | 1                     |     1 |                                      |
|   | 14:45 | 0                      |                       |       |                                      |
|---+-------+------------------------+-----------------------+-------+--------------------------------------|
|   |       | 0                      |                       |       |                                      |
#+TBLFM: $3=$+1 + $+2
#+TBLFM: $3=@#
***** расписание
	 #+CONSTANTS: mult=6.944e-4 
	 |   | описание          | минут | часов | время начала           | время завершения       |   |
	 |---+-------------------+-------+-------+------------------------+------------------------+---|
	 | 2 | готовим           |    40 |     0 | [2020-06-23 Tue 11:40] | [2020-06-23 Tue 12:20] | 9 |
	 | 3 | Кушаем с Соней    |    40 |       | [2020-06-23 Tue 12:20] | [2020-06-23 Tue 13:00] |   |
	 | 4 | встреча с вадимом |     0 |     1 | [2020-06-23 Tue 13:00] | [2020-06-23 Tue 14:00] | 9 |
	 | 5 | встреча с вадимом |     0 |     1 | [2020-06-23 Tue 14:00] | [2020-06-23 Tue 15:00] | 9 |
	 | 6 | встреча с вадимом |     0 |     1 | [2020-06-23 Tue 15:00] | [2020-06-23 Tue 16:00] | 9 |
	 |---+-------------------+-------+-------+------------------------+------------------------+---|
	 #+TBLFM: $5=$6-($3+$4*60)*$mult::$6=if(@#==@>$1,@>$6,@+1$5)::$1=@#
	 #+TBLFM: @>$6= <2020-05-23 Сб 16:00>
	 #+TBLFM: @>$6=  
	 #+TBLFM: $5=0
	 #+TBLFM: $4=0
	 #+TBLFM: $6=0
	 #+TBLFM: $1=@#

******** name
	 Assign a field-name using the ^ mark:
	 |---+---|
	 |   | 1 |
	 |   | 2 |
	 |   | 3 |
	 |---+---|
	 |   | 6 |
	 | ^ | x |
	 |---+---|
	 #+TBLFM: $x=vsum(@1..@-1)
******** bitwins lines 
	 Yet another possibility makes use of horizontal lines (@I, @II, etc.) which are useful anyways to structure your table:

	 | What  |    $$ |
	 |-------+-------|
	 | Ice   |  3.00 |
	 | Soda  |  6.49 |
	 | Gin   |  4.99 |
	 |-------+-------|
	 | Total | 14.48 |
	 #+TBLFM: @>$2=vsum(@I..@II)
******** bitwins Rows 
	 The example below gives the sum of the last column both at the first and the last rows.

	 |      |    T |   8 |
	 | Col1 | Col2 | Sum |
	 |------+------+-----|
	 |    1 |    3 |   4 |
	 |    2 |    8 |  10 |
	 |    3 |   -9 |  -6 |
	 |------+------+-----|
	 |      |      |   8 |
	 #+TBLFM: $3=$1+$2::@1$3=vsum(@I..@II)::@6$3=vsum(@I..@II)
	 #+TBLFM: @1$2=T::

	 vsum sums a vector of numbers; @I and @II refer to the first and second hlines.
******** for sum colum 
	 You can try this:
	 $<col_num>=<func>(@2..@-1))
	 @2 is static. It refers to the 2nd row onwards. @-1 refers to the second to last row.
	 I think this was the easiest and non-intrusive way. It preserves your column names and does not clutter up the visual space. It does not require you to address the last row. It is addressed by default.
	 Rows can be added/removed. No other markers.
	 eg.
	 #+TBLFM: $3=vmean(@2..@-1)::$4=vsum(@2..@-1))
	 Sample table
			| Time                   | Input             | Test      | InQty |
			| <2018-03-13 Tue 06:15> | Water             |           |   200 |
			| <2018-03-13 Tue 07:03> |                   |           |       |
			|                        |                   |           |       |
			| <2018-03-13 Tue 07:31> | Water             |           |   180 |
			| <2018-03-13 Tue 09:00> | Chai              |           |   240 |
			| <2018-03-13 Tue 11:30> | Chai              |           |   240 |
			| <2018-03-13 Tue 16:01> | Water             |           |    60 |
			|                        |                   |           |       |
			|------------------------+-------------------+-----------+-------|
			|                        |                   |           |   920 |
			#+TBLFM: $4=vsum(@2..@-1)
******* aggregate & name: 
	 You may use the orgtbl-aggregate package available on http://melpa.org
	 The sum of Col1 and Col2 is given in the aggregated table below.
	 #+name: cc
	 | Col1 | Col2 | Sum8 |
	 |------+------+------|
	 |    1 |    3 |    4 |
	 |    2 |    8 |   10 |
	 |    3 |   -9 |   -6 |
	 #+TBLFM: $3=$1+$2

	 #+BEGIN: aggregate :table "cc" :cols "vsum(Col1+Col2)"

	 #+END:

	 Documentation here: https://github.com/tbanel/orgaggregate
******** example of a table : 
			 Here is an example of a table that collects exam results of students
		and makes use of these features:

				 |---+---------+--------+--------+--------+-------+------|
				 |   | Student | Prob 1 | Prob 2 | Prob 3 | Total | Note |
				 |---+---------+--------+--------+--------+-------+------|
				 | ! |         |     P1 |     P2 |     P3 |   Tot |      |
				 | # | Maximum |     10 |     15 |     25 |    50 | 10.0 |
				 | ^ |         |     m1 |     m2 |     m3 |    mt |      |
				 |---+---------+--------+--------+--------+-------+------|
				 | # | Peter   |     10 |      8 |     23 |    41 |  8.2 |
				 | # | Sam     |      2 |      4 |      3 |     9 |  1.8 |
				 |---+---------+--------+--------+--------+-------+------|
				 |   | Average |        |        |        |  25.0 |      |
				 | ^ |         |        |        |        |    at |      |
				 | $ | max=50  |        |        |        |       |      |
				 |---+---------+--------+--------+--------+-------+------|
				 |   | 50      |        |        |        |       |      |
				 #+TBLFM: $6=vsum($P1..$P3)::$7=10*$Tot/$max;%.1f::$at=vmean(@-II..@-I);%.1f
				 #+TBLFM: @10$2=$max
********* Important : 
		Important: please note that for these special tables, recalculating the
		table with ‘C-u C-c *’ will only affect rows that are marked ‘#’ or ‘*’,
		and fields that have a formula assigned to the field itself.  The column
		formulas are not applied in rows with empty first field.
******** series of degree ‘n’ at location ‘x’  : 
			 Finally, just to whet your appetite for what can be done with the
		fantastic ‘calc.el’ package, here is a table that computes the Taylor
		series of degree ‘n’ at location ‘x’ for a couple of functions.

				 |---+-------------+---+-----+--------------------------------------|
				 |   | Func        | n | x   | Result                               |
				 |---+-------------+---+-----+--------------------------------------|
				 | # | exp(x)      | 1 | x   | 1 + x                                |
				 | # | exp(x)      | 2 | x   | 1 + x + x^2 / 2                      |
				 | # | exp(x)      | 3 | x   | 1 + x + x^2 / 2 + x^3 / 6            |
				 | # | x^2+sqrt(x) | 2 | x=0 | x*(0.5 / 0) + x^2 (2 - 0.25 / 0) / 2 |
				 | # | x^2+sqrt(x) | 2 | x=1 | 2 + 2.5 x - 2.5 + 0.875 (x - 1)^2    |
				 | * | tan(x)      | 3 | x   | x pi / 180 + 5.72e-8 x^3 pi^3        |
				 |---+-------------+---+-----+--------------------------------------|
				 #+TBLFM: $5=taylor($2,$4,$3);n3

******* ASCII bar plots
	 ---------------
	 While the cursor is on a column, typing ‘C-c " a’ or ‘M-x
	 orgtbl-ascii-plot <RET>’ create a new column containing an ASCII-art
	 bars plot.  The plot is implemented through a regular column formula.
	 When the source column changes, the bar plot may be updated by
	 refreshing the table, for example typing ‘C-u C-c *’.

				| Sede          | Max cites |              |
				|---------------+-----------+--------------|
				| Chile         |    257.72 | WWWWWWWWWWWW |
				| Leeds         |    165.77 | WWWWWWWh     |
				| Sao Paolo     |     71.00 | WWW;         |
				| Stockholm     |    134.19 | WWWWWW:      |
				| Morelia       |    257.56 | WWWWWWWWWWWH |
				| Rochefourchat |      0.00 |              |
				#+TBLFM: $3='(orgtbl-ascii-draw $2 0.0 257.72 12)

			The formula is an elisp call:
				(orgtbl-ascii-draw COLUMN MIN MAX WIDTH)

	 ‘COLUMN’
				is a reference to the source column.

	 ‘MIN MAX’
				are the minimal and maximal values displayed.  Sources values
				outside this range are displayed as ‘too small’ or ‘too large’.

	 ‘WIDTH’
				is the width in characters of the bar-plot.  It defaults to ‘12’.


**** пример 
  #+BEGIN_SRC translate
  Чтобы поймать психа нужен Псих
  #+END_SRC

  #+RESULTS:
	: To catch psycho Psycho needed

<t
<tr

